{
  "companies": [
    {
    "id": 101,
    "name": "BYJU'S",
    "logo": "https://logo.clearbit.com/byjus.com",
    "location": "Bengaluru, Karnataka",
    "industry": "EdTech",
    "founded": 2011,
    "employees": 15000,
    "website": "https://www.byjus.com",
    "rating": 4.3,
    "description": "BYJU'S is a global leader in digital education, offering personalized learning experiences through AI-powered videos, quizzes, and gamified content. It has revolutionized traditional education, making learning interactive and accessible for millions of students across the world."
    },
    {
      "id": 102,
      "name": "Tata Consultancy Services (TCS)",
      "logo": "https://logo.clearbit.com/tcs.com",
      "location": "Mumbai, Maharashtra",
      "industry": "IT Services & Consulting",
      "founded": 1968,
      "employees": 550000,
      "website": "https://www.tcs.com",
      "rating": 4.7,
      "description": "TCS is a global leader in IT services, consulting, and business solutions. It provides software development, enterprise solutions, and digital transformation services to clients worldwide. TCS is known for its innovation-led approach, large talent pool, and robust delivery capabilities. With clients in over 45 countries, TCS helps enterprises embrace future technologies like AI, cloud, and IoT."
    },
    {
      "id": 103,
      "name": "Infosys Ltd",
      "logo": "https://logo.clearbit.com/infosys.com",
      "location": "Bengaluru, Karnataka",
      "industry": "IT & Consulting",
      "founded": 1981,
      "employees": 300000,
      "website": "https://www.infosys.com",
      "rating": 4.6,
      "description": "Infosys is a multinational IT services and consulting company offering next-generation digital services and consulting. It focuses on helping clients navigate their digital transformation journeys with solutions in AI, cloud computing, cybersecurity, and automation. Infosys is also known for its ethical practices, strong corporate governance, and leadership in sustainability and innovation."
    },
    {
      "id":104,
      "name": "Wipro Ltd",
      "logo": "https://logo.clearbit.com/wipro.com",
      "location": "Bengaluru, Karnataka",
      "industry": "IT Services & BPO",
      "founded": 1945,
      "employees": 200000,
      "website": "https://www.wipro.com",
      "rating": 4.5,
      "description": "Wipro is a global leader in information technology, consulting, and business process services. It helps enterprises adopt innovative technologies and improve efficiency through digital solutions. With operations in more than 50 countries, Wipro focuses on delivering customer-centric solutions, cloud modernization, and AI-driven business transformation strategies."
    },
    {
      "id": 105,
      "name": "HDFC Bank Ltd",
      "logo": "https://logo.clearbit.com/hdfcbank.com",
      "location": "Mumbai, Maharashtra",
      "industry": "Banking & Finance",
      "founded": 1994,
      "employees": 150000,
      "website": "https://www.hdfcbank.com",
      "rating": 4.7,
      "description": "HDFC Bank is one of India's leading private sector banks, offering a wide range of financial services including retail banking, loans, investments, and digital banking. Known for its strong customer service, digital innovation, and consistent performance, HDFC Bank has been a key driver of financial inclusion and digital payment adoption in India."
    },
    {
      "id": 106,
      "name": "State Bank of India (SBI)",
      "logo": "https://logo.clearbit.com/sbi.co.in",
      "location": "Mumbai, Maharashtra",
      "industry": "Banking & Financial Services",
      "founded": 1955,
      "employees": 250000,
      "website": "https://www.sbi.co.in",
      "rating": 4.5,
      "description": "SBI is India's largest public sector bank with a massive branch network and strong presence in both rural and urban markets. It offers comprehensive banking solutions, financial services, and digital products. With its legacy, reach, and trust, SBI plays a vital role in India's economic development and financial inclusion initiatives."
    },
    {
      "id": 107,
      "name": "Indian Oil Corporation Ltd",
      "logo": "https://logo.clearbit.com/iocl.com",
      "location": "New Delhi, Delhi",
      "industry": "Oil & Gas",
      "founded": 1959,
      "employees": 33000,
      "website": "https://www.iocl.com",
      "rating": 4.4,
      "description": "Indian Oil is India’s largest commercial oil company, engaged in refining, pipeline transportation, and marketing of petroleum products. It plays a key role in meeting the nation’s energy demands and is actively working on renewable and sustainable energy initiatives to support India's transition to a low-carbon economy."
    },
    {
    "id": 111,
    "name": "Adani Enterprises Ltd",
    "logo": "https://logo.clearbit.com/adani.com",
    "location": "Ahmedabad, Gujarat",
    "industry": "Conglomerate",
    "founded": 1988,
    "employees": 60000,
    "website": "https://www.adani.com",
    "rating": 4.5,
    "description": "Adani Enterprises is the flagship company of the Adani Group, a diversified conglomerate involved in infrastructure, energy, logistics, and resources. The company plays a major role in India's infrastructure development, including airports, ports, renewable energy projects, and data centers. Its rapid global expansion and focus on sustainability make it a leader in India’s industrial growth story."
  },
  {
    "id": 113,
    "name": "Tech Mahindra Ltd",
    "logo": "https://logo.clearbit.com/techmahindra.com",
    "location": "Pune, Maharashtra",
    "industry": "IT & Digital Transformation",
    "founded": 1986,
    "employees": 152000,
    "website": "https://www.techmahindra.com",
    "rating": 4.4,
    "description": "Tech Mahindra is a global leader in IT services and digital transformation solutions. It helps enterprises modernize their operations through next-gen technologies such as 5G, cloud, AI, and IoT. With strong expertise across telecom, manufacturing, and BFSI sectors, Tech Mahindra drives innovation and business agility for clients worldwide."
  },
  {
    "id": 114,
    "name": "Zoho Corporation",
    "logo": "https://logo.clearbit.com/zoho.com",
    "location": "Chennai, Tamil Nadu",
    "industry": "SaaS & Cloud Software",
    "founded": 1996,
    "employees": 15000,
    "website": "https://www.zoho.com",
    "rating": 4.8,
    "description": "Zoho is a leading global SaaS company that provides cloud-based business software for CRM, finance, HR, and productivity. Known for its affordable pricing and privacy-focused solutions, Zoho serves over 90 million users worldwide. It is one of the few Indian tech companies that have grown without external funding, showcasing innovation and customer-centricity."
  }
  ]
}
